Revit 2027 API
Application.NewElementSet Method
Creates a new instance of a set specifically for holding elements.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementSet NewElementSet()
Public Function NewElementSet As ElementSet
public:
ElementSet^ NewElementSet()
member NewElementSet : unit -> ElementSet
Return Value
ElementSet
A new Element Set.
Remarks
This is a general purpose set for passing elements to and from methods.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace